{
  "personal": {
    "name": "Ahmet Rasim Beyhan",
    "title": "Full Stack Geliştirici",
    "bio": "Veri analitiği, full-stack geliştirme ve en yeni teknolojilere tutkuyla bağlı 18 yaşında bir yazılım geliştiricisiyim. Şu anda Teklas'ta Junior Yazılım Geliştirici olarak çalışıyorum; bir yandan da ERP çözümleri geliştirdiğimiz kendi girişimim AgotaSoft'u büyütüyorum.\n\nMicrosoft'tan 120K$+ yatırım desteğiyle girişimimi ilerletirken, aynı zamanda Bilgisayar Programcılığı (2. sınıf) eğitimime devam ediyorum. Odağım, modern teknolojilerle ölçeklenebilir, verimli ve kullanıcı dostu çözümler sunmak.\n\nHer zaman öğrenmeye, denemeye ve etkili projelere katkı sağlamaya hevesliyim.",
    "location": "İstanbul, Türkiye",
    "email": "ahmet@agotasoft.com"
    
  },
  "skills": [
    "Laravel",
    "React",
    ".NET Framework",
    "JavaScript/TypeScript",
    "PHP",
    "C#",
    "MySQL",
    "PostgreSQL",
    "Git",
    "RESTful APIs",
    "Winforms",
    "Qliksense"
  ],
  "experience": [
    {
      "company": "Teklas",
      "position": "Yazılım Geliştirici",
      "period": "Ağu 2025 - Devam Ediyor",
      "description": "Şirkette hem Masaüstü hem Web ERP geliştirme süreçlerinde görev alıyorum, bi yandan Qliksense ile C-level BI analizleri yapıyorum."
    },
    {
      "company": "Teklas",
      "position": "Yazılım Stajyeri",
      "period": "Haz 2025 - Ağu 2025",
      "description": "Şirketin hali hazırda olan ERP sine benzer yapıda bir ERP geliştirdim, stajımda gösterdiğim üstün başarı sonucunda iş teklifi aldım."
    },
    {
      "company": "AgotaSoft",
      "position": "Kurucu & Yönetici",
      "period": "Tem 2024 - Devam Ediyor",
      "description": "2023 Yılından beri Microsoft For Startups programındayız ve AI destekli ERP geliştirmesi yapıyoruz, .NET teknolojilerini kullandığımız bu projemizde ekibimizde 10+ kişi yer almakta. Tübitak BIGG kapsamında birden çok teknoparkta 2. aşamaya geçme hakkını kazandık."
    },
    {
      "company": "Acunmedya Academy & MyStaff",
      "position": "Yazılım Stajyeri",
      "period": "Oca 2025 - May 2025",
      "description": "Web geliştirme ve yazılım geliştirme uygulamalarında uygulamalı deneyim kazandım, modern geliştirme framework'leri kullanarak gerçek dünya projelerinde çalıştım ve çevik geliştirme metodolojileri öğrendim."
    }
   
   
   
  ],
  "education": [
    {
      "institution": "Biruni Üniversitesi",
      "degree": "Bilgisayar Programcılığı",
      "period": "2024 - 2026",
      "details": "Mevcut GPA: 3.10/4.00. Yazılım geliştirme ve veritabanı yönetimi üzerine odaklandım."
    }
  ]
}