{
  "personal": {
    "name": "Ahmet Rasim Beyhan",
    "title": "Full Stack Geliştirici",
    "bio": "Teknoloji yolculuğuma erken yaşta başlayarak, sürekli gelişen teknoloji alanında deneyim kazandım. Profesyonel kariyerim full-stack geliştirme üzerine odaklanıyor; Laravel, .NET, React ve modern web teknolojilerinde becerilerimi geliştiriyorum. Verimli çözümler yaratmaya ve anlamlı projelere katkıda bulunmaya tutkuluyum.",
    "location": "İstanbul, Türkiye",
    "email": "ahmet@agotasoft.com",
    "phone": "+90 552 517 57 81"
  },
  "skills": [
    "Laravel",
    "React",
    ".NET Framework",
    "JavaScript/TypeScript",
    "PHP",
    "C#",
    "MySQL",
    "PostgreSQL",
    "Git",
    "RESTful APIs"
  ],
  "experience": [
    {
      "company": "AgotaSoft",
      "position": "Yazılım Geliştirici",
      "period": "Tem 2024 - Devam Ediyor",
      "description": "Laravel ve .NET framework'leri kullanarak ERP sistemleri geliştirip sürdürüyorum, React ve modern JavaScript ile responsive web uygulamaları oluşturuyorum. Veritabanı performansını optimize etmeye ve verimli veri yapıları uygulamaya odaklanırken çapraz fonksiyonel ekiplerle işbirliği yapıyorum."
    },
    {
      "company": "Acunmedya Academy & MyStaff",
      "position": "Yazılım Stajyeri",
      "period": "Oca 2025 - May 2025",
      "description": "Web geliştirme ve yazılım geliştirme uygulamalarında uygulamalı deneyim kazandım, modern geliştirme framework'leri kullanarak gerçek dünya projelerinde çalıştım ve çevik geliştirme metodolojileri öğrendim."
    },
    {
      "company": "Teklas",
      "position": "Yazılım Stajyeri",
      "period": "Haz 2025 - Ağu 2025",
      "description": "Profesyonel ortamda yazılım geliştirme projelerine katkıda bulundum, backend geliştirme ve veritabanı yönetiminde becerilerimi geliştirdim, kod incelemeleri ve kalite güvence süreçlerine katıldım."
    }
  ],
  "education": [
    {
      "institution": "Biruni Üniversitesi",
      "degree": "Bilgisayar Programcılığı",
      "period": "2024 - 2026",
      "details": "Mevcut GPA: 3.10/4.00. Yazılım geliştirme ilkeleri ve modern programlama dilleri üzerine odaklandım, kodlama yarışmaları ve teknik projelerde aktif katılım gösterdim."
    }
  ]
}